Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DeletedViewRangeLevel { get; }
  Visual Basic
Public Shared ReadOnly Property DeletedViewRangeLevel As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DeletedViewRangeLevel {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PlanRegionFailures Class
  Autodesk.Revit.DB Namespace